In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])

In [4]:
df

   A  B
0  4  9
1  4  9
2  4  9

In [5]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [6]:
df.apply(np.sum, axis='rows')

A    12
B    27
dtype: int64

In [7]:
df.apply(np.sum, axis='columns')

0    13
1    13
2    13
dtype: int64

In [8]:
df.apply(lambda x: (), axis='columns', result_type='expand')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [9]:
ngur = pd.DataFrame({
    'a': ["a b c", "e f c", "a b d"]
})
# ngur[["aa","bb", "cc"]] = ngur.a.str.split(" ")
ngur.info()
ngur.a.str.split(" ", expand=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
a    3 non-null object
dtypes: object(1)
memory usage: 104.0+ bytes

   0  1  2
0  a  b  c
1  e  f  c
2  a  b  d

In [10]:
import string

np1 = np.random.RandomState(42)
x = np1.randn(5, 5) * 100
v = np.vectorize(lambda x: abs(int(x)))
df = pd.DataFrame(v(x), columns=list(string.ascii_lowercase[0:5]))
df

     a    b   c    d    e
0   49   13  64  152   23
1   23  157  76   46   54
2   46   46  24  191  172
3   56  101  31   90  141
4  146   22   6  142   54

In [11]:
row = df.iloc[0]
df.sub(row, axis='columns').add(row, axis='columns')

     a    b   c    d    e
0   49   13  64  152   23
1   23  157  76   46   54
2   46   46  24  191  172
3   56  101  31   90  141
4  146   22   6  142   54

In [12]:
column = df['a']
df.sub(column, axis='rows').add(column, axis='rows')

     a    b   c    d    e
0   49   13  64  152   23
1   23  157  76   46   54
2   46   46  24  191  172
3   56  101  31   90  141
4  146   22   6  142   54

In [13]:
df.iloc[np.where(df['a'] > 50)]

     a    b   c    d    e
3   56  101  31   90  141
4  146   22   6  142   54

In [14]:
df[df['a'] > 50]

     a    b   c    d    e
3   56  101  31   90  141
4  146   22   6  142   54

In [15]:

df[df['a'] < df['a'].median()]

    a    b   c    d    e
1  23  157  76   46   54
2  46   46  24  191  172

In [16]:
df.iloc[df['b'].idxmax()]

a     23
b    157
c     76
d     46
e     54
Name: 1, dtype: int32

In [17]:
np1 = np.random.RandomState(42)
data = pd.Series(np1.randint(0, 100, size=5))
data.value_counts()

71    1
14    1
92    1
51    1
60    1
dtype: int64

In [18]:
import requests

url = "https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/baseball.csv"
myfile = requests.get(url)
# open("baseball.csv", "wb").write(myfile.content)

In [19]:
import statsmodels.formula.api as sm

bb = pd.read_csv('baseball.csv', index_col='id')

In [20]:
bb.columns

Index(['player', 'year', 'stint', 'team', 'lg', 'g', 'ab', 'r', 'h', 'X2b',
       'X3b', 'hr', 'rbi', 'sb', 'cs', 'bb', 'so', 'ibb', 'hbp', 'sh', 'sf',
       'gidp'],
      dtype='object')

In [21]:
(bb.query('h > 0')
 .assign(ln_h=lambda df: np.log(df.h))
 .pipe((sm.ols, 'data'), 'hr ~ ln_h + year + g + C(lg)')
 .fit()
 .summary()
)

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                     hr   R-squared:                       0.685
Model:                            OLS   Adj. R-squared:                  0.665
Method:                 Least Squares   F-statistic:                     34.28
Date:                Mon, 04 Nov 2019   Prob (F-statistic):           3.48e-15
Time:                        07:57:00   Log-Likelihood:                -205.92
No. Observations:                  68   AIC:                             421.8
Df Residuals:                      63   BIC:                             432.9
Df Model:                           4
Covariance Type:            nonrobust
===============================================================================
                  coef    std err          t      P>|t|      [0.025      0.975]
-------------------------------------------------------------------------------
Intercept   -8484.7720   4664.146     -1.819      0.074   -1.78e+04     835.780
C(lg)[T.NL]    -2.2736      1.325     -1.716      0.091      -4.922       0.375
ln_h           -1.3542      0.875     -1.547      0.127      -3.103       0.395
year            4.2277      2.324      1.819      0.074      -0.417       8.872
g               0.1841      0.029      6.258      0.000       0.125       0.243
==============================================================================
Omnibus:                       10.875   Durbin-Watson:                   1.999
Prob(Omnibus):                  0.004   Jarque-Bera (JB):               17.298
Skew:                           0.537   Prob(JB):                     0.000175
Kurtosis:                       5.225   Cond. No.                     1.49e+07
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
[2] The condition number is large, 1.49e+07. This might indicate that there are
strong multicollinearity or other numerical problems.
"""

In [22]:
a = pd.DataFrame(
    {'a': [1, 2, 3, 4]}
)
a
b = pd.Index([2, 3])
a['a'].loc[b] = [1, 2]
a

   a
0  1
1  2
2  1
3  2

In [23]:
import numpy as np
a = pd.DataFrame(
    {'a': [1.0, 2.0, 3.3, 4.4]}
)
print(a.info())
a['a'] = a['a'].astype(int)
a

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
a    4 non-null float64
dtypes: float64(1)
memory usage: 112.0 bytes
None

   a
0  1
1  2
2  3
3  4

In [51]:
a = pd.DataFrame({
 'a': [1, 2, 1, 2],
    'b': [1, 2, 3, 4],
    'c': [2, 3, 4, 5]
}
)
a
a.groupby('a').agg(list)

        b       c
a
1  [1, 3]  [2, 4]
2  [2, 4]  [3, 5]

In [53]:
from functools import reduce 

def test_sum(series):
    return reduce(lambda x, y: x + y, series)

def test_func(x, y):
    return x + y

def test_sum1(series):
    return reduce(test_func, series)


a.groupby('a').agg({'b': [test_sum, 'sum', test_sum1]})

         b
  test_sum sum test_sum1
a
1        4   4         4
2        6   6         6

In [56]:
print(a.groupby('a').agg(list))
a

        b       c
a
1  [1, 3]  [2, 4]
2  [2, 4]  [3, 5]

   a  b  c
0  1  1  2
1  2  2  3
2  1  3  4
3  2  4  5

In [58]:

def test_func(x, y):
    return x + y

def test_sum1(series):
    return reduce(test_func, series)

a.groupby('a')

In [73]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                            'foo', 'bar', 'foo', 'foo'],
                    'B': ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                      'C': np.random.randn(8),
                    'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.230757  0.579108
1  bar    one  0.452132 -0.625231
2  foo    two  0.580442 -2.925693
3  bar  three  1.129080  0.976518
4  foo    two -0.794503  1.805694
5  bar    two -0.940710 -0.006547
6  foo    one  0.334003 -0.303898
7  foo  three  0.440507  0.116015

In [77]:
grouped = df.groupby('A')
grouped.groups

{'bar': Int64Index([1, 3, 5], dtype='int64'),
 'foo': Int64Index([0, 2, 4, 6, 7], dtype='int64')}

In [64]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'
   

grouped = df.groupby(get_letter_type, axis=1)

In [74]:
grouped.get_group('vowel')

     A
0  foo
1  bar
2  foo
3  bar
4  foo
5  bar
6  foo
7  foo

In [118]:
df = pd.DataFrame({'A': 'a b a b'.split(), 'B': [1, 2, 3, 4], 'C': [2, 4, 6, 8]})
df

   A  B  C
0  a  1  2
1  b  2  4
2  a  3  6
3  b  4  8

In [106]:
df.groupby('A').apply(lambda x: x.max() - x.min())

   B  C
A
a  2  3
b  2  2

In [119]:
def f(x):
    return np.mean(x['B'] - x['C'])

print(df)
df.groupby('A').apply(f)

   A  B  C
0  a  1  2
1  b  2  4
2  a  3  6
3  b  4  8

A
a   -2.0
b   -3.0
dtype: float64

In [200]:
df[['B', 'C']]

   B  C
0  1  2
1  2  4
2  3  6
3  4  8

In [201]:
def do_split(x):
    return x.split()

a = pd.DataFrame({
    'a': [1, 2, 1, 2, 1],
    'b': ["1,2,3", "4,5", "6,7", "8,9", "10,11"], 
    'c': ["1,2,3", "4,5", "6,7", "8,9", "10,11"], 
})

a.groupby('a').apply(lambda x: (x['b'].apply(do_split), x['c'].apply(do_split)))

a
1    ([[1,2,3], [6,7]], [[1,2,3], [6,7]])
2        ([[4,5], [8,9]], [[4,5], [8,9]])
dtype: object

In [202]:
type(a
 .groupby('a')
 .apply(lambda x: (x['b'].apply(do_split), x['c'].apply(do_split)))
)
x = (a
 .groupby('a')
 .apply(lambda x: (x['b'].apply(do_split), x['c'].apply(do_split))))
x

a
1    ([[1,2,3], [6,7]], [[1,2,3], [6,7]])
2        ([[4,5], [8,9]], [[4,5], [8,9]])
dtype: object

In [211]:
x = (a
 .groupby('a')
 .apply(lambda y: y['b'].apply(do_split))
    )

In [212]:
print("x shape", x.shape)
print(x)
for i in range(x.shape[0]):
    print()
    print(i, type(x[i]))
    print(f"x[{i}]\n", x[i])

x shape (5,)
a
1  0    [1,2,3]
   2      [6,7]
   4    [10,11]
2  1      [4,5]
   3      [8,9]
Name: b, dtype: object

0 <class 'list'>
x[0]
 ['1,2,3']

1 <class 'pandas.core.series.Series'>
x[1]
 0    [1,2,3]
2      [6,7]
4    [10,11]
Name: b, dtype: object

2 <class 'pandas.core.series.Series'>
x[2]
 1    [4,5]
3    [8,9]
Name: b, dtype: object

3 <class 'list'>
x[3]
 ['4,5']

4 <class 'list'>
x[4]
 ['8,9']

In [234]:
for i in x.index.levels[0]:
    print(type(x[i]))
    print(x[i])

<class 'pandas.core.series.Series'>
0    [1,2,3]
2      [6,7]
4    [10,11]
Name: b, dtype: object
<class 'pandas.core.series.Series'>
1    [4,5]
3    [8,9]
Name: b, dtype: object

In [244]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df.set_index("Team").groupby(lambda x: x).agg("mean")

            Rank         Year      Points
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [261]:
df.groupby(["Team", "Rank"]).count()

             Year  Points
Team   Rank
Devils 2        1       1
       3        1       1
Kings  1        2       2
       3        1       1
Riders 1        1       1
       2        3       3
Royals 1        1       1
       4        1       1
kings  4        1       1

Calculate the percentage within a category

In [282]:
x = df.groupby(["Team", "Rank"]).agg({"Year": "count"})

In [283]:
y = df.groupby(["Team"]).agg({"Year": "count"})

In [291]:
x.index.get_level_values(0)

Index(['Devils', 'Devils', 'Kings', 'Kings', 'Riders', 'Riders', 'Royals',
       'Royals', 'kings'],
      dtype='object', name='Team')

In [292]:
y.index.get_level_values(0)

Index(['Devils', 'Kings', 'Riders', 'Royals', 'kings'], dtype='object', name='Team')

In [302]:
y.loc[x.index.get_level_values(0)]["Year"]

Team
Devils    2
Devils    2
Kings     3
Kings     3
Riders    4
Riders    4
Royals    2
Royals    2
kings     1
Name: Year, dtype: int64